Why not Lists?

In [1]:
names = ['Ram', 'Rahim', 'Hari', 'Raju']
heights = [169, 171, 168, 173]

In [2]:
ind_hari = names.index('Hari')
heights[ind_hari]

168

So, it is not convenient for large scale dataset. Hence we use <b>Dictionaries</b>

In [3]:
persons = {'Ram': 169, 'Rahim': 171, 'Hari': 168, 'Raju': 173}

In [4]:
persons['Ram']

169

In [5]:
persons['Rahim']

171

In [6]:
# check the keys of the dictionary
persons.keys()

dict_keys(['Ram', 'Rahim', 'Hari', 'Raju'])

## Dictionary Manipulations
+ adding new element
+ updating an existing element
+ removing an element

In [7]:
europe = {'spain':'madrid', 'france':'paris', 'germany':'munich', 'norway':'oslo' }

In [8]:
# adding italy to europe
europe['italy'] = 'rome'

In [9]:
# adding to europe
europe['poland'] = 'warsaw'

In [10]:
europe

{'spain': 'madrid',
 'france': 'paris',
 'germany': 'munich',
 'norway': 'oslo',
 'italy': 'rome',
 'poland': 'warsaw'}

In [11]:
# updating capital of germany
europe['germany'] = 'berlin'

In [12]:
europe

{'spain': 'madrid',
 'france': 'paris',
 'germany': 'berlin',
 'norway': 'oslo',
 'italy': 'rome',
 'poland': 'warsaw'}

In [13]:
# removing australia
del(europe['norway'])

In [14]:
europe

{'spain': 'madrid',
 'france': 'paris',
 'germany': 'berlin',
 'italy': 'rome',
 'poland': 'warsaw'}

## Nested Dictionaries

In [15]:
# dictionary of dictionaries
europe = { 'spain': { 'capital':'madrid', 'population':46.77 },
           'france': { 'capital':'paris', 'population':66.03 },
           'germany': { 'capital':'berlin', 'population':80.62 },
           'norway': { 'capital':'oslo', 'population':5.084 } }

In [16]:
europe

{'spain': {'capital': 'madrid', 'population': 46.77},
 'france': {'capital': 'paris', 'population': 66.03},
 'germany': {'capital': 'berlin', 'population': 80.62},
 'norway': {'capital': 'oslo', 'population': 5.084}}

In [17]:
# to select data from nested dictionaries we use chained square brackets
europe['spain']['capital']

'madrid'

## Pandas

Pandas is a high level data manipulation tool built on top of NumPy package.

Although we can create multi-dimensional arrays using NumPy, we do not use NumPy package as a data manipulation tool. Why?

### Creating DataFrames using Pandas

In [29]:
data = {
    'Country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
    'Capital': ['Brasilia', 'Moscow', 'New Delhi', 'Beijing', 'Pretoria'],
    'Area': [8.516, 17.01, 3.286, 9.597, 1.221],
    'Population': [200.4, 143.5, 1252, 1357, 52.98]
}

In [30]:
import pandas as pd

In [31]:
brics = pd.DataFrame(data)

In [32]:
brics

        Country    Capital    Area  Population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.010      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

#### Setting index in the dataset

In [33]:
brics.index = ['BR', 'RU', 'IN', 'CH', 'SA']

In [34]:
brics

         Country    Capital    Area  Population
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.010      143.50
IN         India  New Delhi   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

#### Reseting the index back to original

In [35]:
brics.reset_index()

  index       Country    Capital    Area  Population
0    BR        Brazil   Brasilia   8.516      200.40
1    RU        Russia     Moscow  17.010      143.50
2    IN         India  New Delhi   3.286     1252.00
3    CH         China    Beijing   9.597     1357.00
4    SA  South Africa   Pretoria   1.221       52.98

#### Setting another column as Index

In [37]:
brics.set_index('Country')

                Capital    Area  Population
Country
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.010      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

### Loading a dataset as a DataFrame

In [38]:
cars = pd.read_csv('cars.csv')

In [39]:
cars

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JAP           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True
5        MOR            70        Morocco          True
6         EG            45          Egypt          True

In [40]:
cars = pd.read_csv('cars.csv', index_col=0)

In [41]:
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

#### Indexing and Selecting data from DataFrame
+ square brackets
+ loc and iloc methods

Suppose you want to extract only the <b>country</b> variable from the dataset, use the brackets on dataset

In [45]:
cars['country']

US     United States
AUS        Australia
JAP            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object

In [47]:
type(cars['country']) # you can think of Series as 1-D NumPy arraY

pandas.core.series.Series

In [48]:
cars[['country']]

           country
US   United States
AUS      Australia
JAP          Japan
IN           India
RU          Russia
MOR        Morocco
EG           Egypt

In [49]:
type(cars[['country']])

pandas.core.frame.DataFrame

In [51]:
cars[['cars_per_cap', 'country']]

     cars_per_cap        country
US            809  United States
AUS           731      Australia
JAP           588          Japan
IN             18          India
RU            200         Russia
MOR            70        Morocco
EG             45          Egypt

#### selecting rows (observations) from the dataset

In [53]:
cars[1:4]

     cars_per_cap    country  drives_right
AUS           731  Australia         False
JAP           588      Japan         False
IN             18      India         False

#### Other Advanced Indexing techniques
+ loc (label based)
+ iloc (integer position based)

it is similar to subsetting 2-D NumPy arrays

In [54]:
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [55]:
cars.loc['AUS']

cars_per_cap          731
country         Australia
drives_right        False
Name: AUS, dtype: object

In [56]:
cars.loc[['AUS']]

     cars_per_cap    country  drives_right
AUS           731  Australia         False

In [57]:
cars.loc[['AUS', 'RU', 'US']]

     cars_per_cap        country  drives_right
AUS           731      Australia         False
RU            200         Russia          True
US            809  United States          True

In [66]:
cars.loc[['AUS', 'RU', 'US'], ['country', 'cars_per_cap']]

           country  cars_per_cap
AUS      Australia           731
RU          Russia           200
US   United States           809

In [67]:
cars.loc[:, ['country', 'cars_per_cap']]

           country  cars_per_cap
US   United States           809
AUS      Australia           731
JAP          Japan           588
IN           India            18
RU          Russia           200
MOR        Morocco            70
EG           Egypt            45

#### Advantages and Disadvantages of Different Data Manipulation Techniques

Square Brackets has 
+ column access
+ they have row access only through slicing e.g. cars[1:4]

loc (label based) technique has
+ row access e.g. cars.loc[['AUS', 'RU', 'US']]
+ column access e.g. cars.loc[:, ['AUS', 'RU', 'US']]
+ both row and column access cars.loc[['AUS', 'RU', 'US'], ['country', 'cars_per_cap']]

We can also subset Pandas DataFrame based on index of observations instead of their labels using <b>iloc</b> method

In [68]:
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [70]:
cars.iloc[[1, 4, 0]]

     cars_per_cap        country  drives_right
AUS           731      Australia         False
RU            200         Russia          True
US            809  United States          True

In [72]:
cars.iloc[[1, 4, 0], [1, 0]]

           country  cars_per_cap
AUS      Australia           731
RU          Russia           200
US   United States           809

In [73]:
cars.iloc[:, [1, 0]]

           country  cars_per_cap
US   United States           809
AUS      Australia           731
JAP          Japan           588
IN           India            18
RU          Russia           200
MOR        Morocco            70
EG           Egypt            45